
# 货物模板图片路径
ptdir = 'tpl/'

# 货物中心坐标,相对坐标
goods_position = [[263, 231], [417, 159], [570, 68]]

# 货物绝对坐标，在1920*1080图上的坐标
goods_abs_position = ((657,1639),(821,1555),(964,1475))

# 货物对应的建筑物编号，按需修改
goods_mapping ={
    'bottle': 4,
     'box': 2,
     'chair': 1,
     'chicken': 6,
     'food': 8,
     'mineral': 9,
     'sofa': 3,
     'vegetable': 5,
     'wood': 7
}

# 建筑物的绝对坐标
bld_positions = {
    1: (294, 1184),
    2: (551, 1061),
    3: (807, 961),
    4: (275, 935),
    5: (535, 810),
    6: (799, 687),
    7: (304, 681),
    8: (541, 568),
    9: (787, 447)
}
